# IsCustom Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionHandler..::..IsCustom Method
StructuralConnectionHandler Class See Also
---
Checks if Structural Connection Handler has the custom connection style.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool IsCustom()
```

Visual Basic
---
```text
Public Function IsCustom As Boolean
```

Visual C++
---
```text
public:
bool IsCustom()
```

# ### Return Value
True if Structural Connection Handler has the custom connection style.
# See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace